# ================================== #
# Internal Macros #
# Do not update these macros #
# ================================== #
[cs_cyences_index]
definition = index=cyences
iseval = 0

[cs_reports]
definition = ("Windows - Hosts Lookup Gen", "Ransomware - Calculate UpperBound for Spike in File Writes", "Palo Alto Firewall - Malicious IP List Gen", "Dynamically Update Blocked IPs with HoneyDB", "Palo Alto Firewall - Network Compromise - DDoS Attack Prevented", "Palo Alto Firewall - Network Compromise - Inbound Traffic from Blocked IPs", "Palo Alto Firewall - Network Compromise - Outbound Traffic to Blocked IPs", "Device Inventory - Lansweeper", "Device Inventory - Tenable", "Device Inventory - Tenable Vuln", "Device Inventory - Qualys", "Device Inventory - Sophos", "Device Inventory - Windows Defender", "Device Inventory - CrowdStrike", "Device Inventory Gen", "Device Inventory Temp Lookup CleanUp", "Device Inventory Lookup CleanUp", "Device Inventory Backfill", "AD - cs_ad_obj_domain - Lookup Gen", "AD - cs_ad_obj_gpo - Lookup Gen", "AD - cs_ad_obj_group - Lookup Gen", "AD - cs_ad_obj_user - Lookup Gen")
iseval = 0

[cs_monthly_alerts]
definition = ("Windows - Hosts Missing Update")
iseval = 0

[cs_daily_alerts]
definition = search NOT savedsearch_name IN `cs_monthly_alerts` NOT savedsearch_name IN `cs_reports`
iseval = 0

[cs_filter_savedsearches(1)]
args = name
definition = regex savedsearch_name="($name$)\s" | rex field=savedsearch_name "^.*\-\s(?<Name>.*)$"
iseval = 0

# Time
[cs_human_readable_time_format(1)]
args = field
definition = eval "$field$" = strftime('$field$', "%F %T")
iseval = 0

[cs_human_readable_time_format(2)]
args = oldfield, newfield
definition = eval "$newfield$" = strftime('$oldfield$', "%F %T") | fields - '$oldfield$'
iseval = 0

# For time-based filteration
[cs_generate_time_fields_for_filter]
definition = eval firstTime_ptime=strptime(firstTime, "%F %T"), firstTime_wday=strftime(firstTime_ptime, "%A"), firstTime_date=tonumber(strftime(firstTime_ptime, "%e")), firstTime_hour=tonumber(strftime(firstTime_ptime, "%H")), firstTime_minute=tonumber(strftime(tmp, "%M")) \
| eval lastTime_ptime=strptime(lastTime, "%F %T"), lastTime_wday=strftime(lastTime_ptime, "%A"), lastTime_date=tonumber(strftime(lastTime_ptime, "%e")), lastTime_hour=tonumber(strftime(lastTime_ptime, "%H")), lastTime_minute=tonumber(strftime(lastTime_ptime, "%M")) \
| eval event_ptime=strptime(event_ptime, "%F %T"), event_wday=strftime(event_ptime, "%A"), event_date=tonumber(strftime(event_ptime, "%e")), event_hour=tonumber(strftime(event_ptime, "%H")), event_minute=tonumber(strftime(event_ptime, "%M"))
iseval = 0

[cs_remove_time_fields_for_filter]
definition = fields - event_wday, event_date, event_hour, event_minute, event_ptime, lastTime_wday, lastTime_date, lastTime_hour, lastTime_minute, lastTime_ptime, firstTime_wday, firstTime_date, firstTime_hour, firstTime_minute, firstTime_ptime
iseval = 0


# Network
[cs_filter_private_ips]
definition = NOT (src_ip=10.0.0.0/8 OR src_ip=172.16.0.0/12 OR src_ip=192.168.0.0/16)
iseval = 0

[cs_palo_search_blocked_ip(1)]
args = field_name
definition = lookup `cs_palo_search_blocked_ip_lookup_name` ip as $field_name$ OUTPUT blocked | search blocked=1 | fields - blocked
iseval = 0

[cs_palo_malicious_ip_list_filter_previous_results(1)]
args = filter_from
definition = where last_seen>relative_time(now(), "$filter_from$")
iseval = 0

[cs_network_generate_location_for_internal_network(1)]
args = ip
definition = eval lat=if(cidrmatch("10.0.0.0/8",$ip$) OR cidrmatch("172.16.0.0/12",$ip$) OR cidrmatch("192.168.0.0/16",$ip$), `cs_network_home_location_lat`, lat) \
| eval lon=if(cidrmatch("10.0.0.0/8",$ip$) OR cidrmatch("172.16.0.0/12",$ip$) OR cidrmatch("192.168.0.0/16",$ip$), `cs_network_home_location_lon`, lon)
iseval = 0

[cs_network_filter_internal_traffic]
definition = eval start_lat=if(cidrmatch("10.0.0.0/8",src_ip) OR cidrmatch("172.16.0.0/12",src_ip) OR cidrmatch("192.168.0.0/16",src_ip), `cs_network_home_location_lat`, start_lat) \
| eval start_lon=if(cidrmatch("10.0.0.0/8",src_ip) OR cidrmatch("172.16.0.0/12",src_ip) OR cidrmatch("192.168.0.0/16",src_ip), `cs_network_home_location_lon`, start_lon) \
| eval end_lat=if(cidrmatch("10.0.0.0/8",dest_ip) OR cidrmatch("172.16.0.0/12",dest_ip) OR cidrmatch("192.168.0.0/16",dest_ip), `cs_network_home_location_lat`, end_lat) \
| eval end_lon=if(cidrmatch("10.0.0.0/8",dest_ip) OR cidrmatch("172.16.0.0/12",dest_ip) OR cidrmatch("192.168.0.0/16",dest_ip), `cs_network_home_location_lon`, end_lon) \
| where start_lat!=end_lat OR start_lon!=end_lon
iseval = 0

[cs_network_animate_pulse_traffic_map]
definition = eval animate="true", pulse_at_start="true"
iseval = 0

[cs_network_animate_traffic_map]
definition = eval animate="true"
iseval = 0

[cs_network_traffic_top]
definition = 20
iseval = 0

[cs_network_scanning_min_dc_ports]
definition = 100
iseval = 0

[cs_all_indexes]
definition = index=*
iseval = 0

# Qualys
[cs_qualys_hostsummary]
definition = `cs_qualys` "HOSTSUMMARY:"
iseval = 0

[cs_qualys_vuln]
definition = `cs_qualys` "HOSTVULN:"
iseval = 0

# Tenable
[cs_tenable_assets]
definition = `cs_tenable` sourcetype IN ("tenable:io:assets", "tenable:sc:assets")
iseval = 0

[cs_tenable_vuln]
definition = `cs_tenable` sourcetype IN ("tenable:io:vuln", "tenable:sc:vuln")
iseval = 0


# Device Inventory Related
[cs_device_inventory_out_to_temp_lookup]
definition = eval indextime=now() | table indextime, time, ip, hostname, mac_address, tenable_uuid, qualys_id, lansweeper_id, sophos_uuid, crowdstrike_userid, windows_defender_host | outputlookup append=T cs_device_inventory_temp
iseval = 0

[cs_device_inventory_data_format]
definition = inputlookup cs_device_inventory \
| mvexpand lansweeper_id | mvexpand tenable_uuid | mvexpand qualys_id | mvexpand sophos_uuid | mvexpand windows_defender_host | mvexpand crowdstrike_userid \
| join lansweeper_id type=left [| inputlookup cs_lansweeper_inventory | rename time as lansweeper_last_event | fields - ip, hostname, mac_address, tenable_uuid, qualys_id, sophos_uuid, crowdstrike_userid, windows_defender_host] \
| join tenable_uuid type=left [| inputlookup cs_tenable_vuln \
| stats max(_time) as _time, count, count(eval(vul_state="open" OR vul_state="reopened")) as active, count(eval(vul_state="fixed")) as fixed by tenable_uuid, vul_severity \
| stats max(_time) as _time, sum(count) as total_vuln, sum(eval(if(vul_severity="informational", count, 0))) as info_vuln, sum(eval(if(vul_severity="low", count, 0))) as low_vuln, sum(eval(if(vul_severity="medium", count, 0))) as medium_vuln, sum(eval(if(vul_severity="high", count, 0))) as high_vuln, sum(eval(if(vul_severity="critical", count, 0))) as critical_vuln, sum(active) as active_vuln, sum(eval(if(vul_severity="informational", active, 0))) as info_active_vuln, sum(eval(if(vul_severity="low", active, 0))) as low_active_vuln, sum(eval(if(vul_severity="medium", active, 0))) as medium_active_vuln, sum(eval(if(vul_severity="high", active, 0))) as high_active_vuln, sum(eval(if(vul_severity="critical", active, 0))) as critical_active_vuln, sum(fixed) as fixed_vuln, sum(eval(if(vul_severity="informational", fixed, 0))) as info_fixed_vuln, sum(eval(if(vul_severity="low", fixed, 0))) as low_fixed_vuln, sum(eval(if(vul_severity="medium", fixed, 0))) as medium_fixed_vuln, sum(eval(if(vul_severity="high", fixed, 0))) as high_fixed_vuln, sum(eval(if(vul_severity="critical", fixed, 0))) as critical_fixed_vuln by tenable_uuid \
| append [| inputlookup cs_tenable_inventory] | stats values(*) as *, max(time) as time by tenable_uuid \
| rename time as tenable_last_event, created_at as tenable_created_at, first_seen as tenable_first_seen, last_seen as tenable_last_seen \
| fields - ip, hostname, mac_address, qualys_id, lansweeper_id, sophos_uuid, crowdstrike_userid, windows_defender_host] \
| join qualys_id type=left [| inputlookup cs_qualys_inventory | rename time as qualys_last_event | fields - ip, hostname, mac_address, tenable_uuid, lansweeper_id, sophos_uuid, crowdstrike_userid, windows_defender_host] \
| join sophos_uuid type=left [| inputlookup cs_sophos_inventory | rename time as sophos_last_event | fields - ip, hostname, mac_address, tenable_uuid, qualys_id, lansweeper_id, crowdstrike_userid, windows_defender_host] \
| join windows_defender_host type=left [| inputlookup cs_windows_defender_inventory | rename time as defender_last_event | fields - ip, hostname, mac_address, tenable_uuid, qualys_id, lansweeper_id, sophos_uuid, crowdstrike_userid] \
| join crowdstrike_userid type=left [| inputlookup cs_crowdstrike_inventory | rename time as crowdstrike_last_event | fields - ip, hostname, mac_address, tenable_uuid, qualys_id, lansweeper_id, sophos_uuid, windows_defender_host] \
| stats values(*) as * by uuid \
| rename time as _time \
| eval lansweeper_os=coalesce(lansweeper_os, AssetType." ".OSVersion." ".AssetVersion) | eval os=coalesce(sophos_os, tenable_os, QUALYS_OS, lansweeper_os) \
| eval user=mvdedup(mvappend(lansweeper_user, sophos_user, crowdstrike_userid)) \
| eval lansweeper_status=case(isnull(lansweeper_last_event), "-", 1==1, lansweeper_state) \
| eval tmp_lansweeper_status = lansweeper_status, lansweeper=case(tmp_lansweeper_status=="Non-active",1,tmp_lansweeper_status=="Active",0) \
| fieldformat lansweeper=tmp_lansweeper_status \
| eval qualys_status=case(isnull(qualys_last_event), "-", ACTIVE_SEVERITY_5>0, "Red", ACTIVE_SEVERITY_4>0, "Orange", ACTIVE_SEVERITY_3>0, "Yellow", 1==1, "Green") \
| eval tmp_qualys_status = qualys_status, qualys=case(tmp_qualys_status == "Red", 3,tmp_qualys_status=="Orange",2, tmp_qualys_status=="Yellow",1, tmp_qualys_status=="Green",0) \
| fieldformat qualys=tmp_qualys_status \
| eval tenable_status=case(isnull(tenable_last_event), "-", critical_active_vuln>0, "Red", high_active_vuln>0, "Orange", medium_active_vuln>0, "Yellow", 1==1, "Green") \
| eval tmp_tenable_status = tenable_status, tenable=case(tmp_tenable_status == "Red", 3,tmp_tenable_status=="Orange",2, tmp_tenable_status=="Yellow",1, tmp_tenable_status=="Green",0) \
| fieldformat tenable=tmp_tenable_status \
| eval defender_status=case(isnull(defender_last_event), "-", 1==1, RTP_state) \
| eval tmp_defender_status = defender_status, defender=case(tmp_defender_status == "Enabled", 0,tmp_defender_status=="Disabled",1,true(),tmp_defender_status) \
| fieldformat defender=tmp_defender_status \
| eval sophos_status=case(isnull(sophos_last_event), "-", isnull(sophos_status), "RTP Enabled", 1==1, sophos_status) \
| eval tmp_sophos_status = sophos_status, sophos=case(tmp_sophos_status == "RTP Enabled", 0,tmp_sophos_status=="RTP Disabled",1,tmp_sophos_status=="Service not Running",2) \
| fieldformat sophos=tmp_sophos_status \
| eval crowdstrike_status=if(isnull(crowdstrike_last_event), "-", "Present") \
| eval tmp_crowdstrike_status = crowdstrike_status, crowdstrike=case(tmp_crowdstrike_status == "Present", 0) \
| fieldformat crowdstrike=tmp_crowdstrike_status \
| eval ip_drilldown=mvjoin(ip, ","), hostname_drilldown=mvjoin(hostname, ","), user_drilldown=mvjoin(user, ",") \
| eval active_vul=coalesce(active_vuln, ACTIVE), total_vul=coalesce(total_vuln, TOTAL_VULNS) \
| table _time, uuid, ip, hostname, mac_address, user, os, lansweeper, qualys, tenable, active_vul, total_vul, sophos, defender, crowdstrike, tmp_*, *_last_event, ip_drilldown, hostname_drilldown, user_drilldown \
| fields - crowdstrike_status, sophos_status, defender_status, tenable_status, qualys_status, lansweeper_status
iseval = 0

[cs_windows_defender_inventory_fill_search]
definition = dedup host \
| eval hostname=lower(host), ip="", mac_address="", Last_full_scan_start_time=if(Last_full_scan_start_time="1/1/1601 12:00:00 AM", "-", Last_full_scan_start_time), Last_full_scan_end_time=if(Last_full_scan_end_time="1/1/1601 12:00:00 AM", "-", Last_full_scan_end_time),  Last_quick_scan_start_time=if(Last_quick_scan_start_time="1/1/1601 12:00:00 AM", "-", Last_quick_scan_start_time), Last_quick_scan_end_time=if(Last_quick_scan_end_time="1/1/1601 12:00:00 AM", "-", Last_quick_scan_end_time) \
| rename host as windows_defender_host \
| table _time, windows_defender_host, hostname, ip, mac_address, RTP_state, Platform_version, Engine_version, AVSignature_version, BM_state, IOAV_state, OA_state, Last_full_scan_start_time, Last_full_scan_end_time, Last_quick_scan_start_time, Last_quick_scan_end_time \
| append [| inputlookup cs_windows_defender_inventory | rename time as _time] \
| stats latest(_time) as time, latest(*) as * by windows_defender_host \
| eval _key=windows_defender_host | outputlookup cs_windows_defender_inventory \
| `cs_device_inventory_out_to_temp_lookup`




# ================================== #
# Do not update these macros - Internal macros used to avoid known false positives #
# ================================== #

#Ransomware
[cs_system_processes_run_from_unexpected_locations_internal_filter]
definition = search NOT process_path IN ("C:\\Program Files\\Common Files\\microsoft shared\\MSInfo\\msinfo32.exe","C:\\Users\\*\\AppData\\Local\\Temp\\*\\DismHost.exe","C:\\Users\\*\\AppData\\Local\\Microsoft\\OneDrive\\Update\\OneDriveSetup.exe","C:\\Users\\*\\AppData\\Local\\Microsoft\\OneDrive\\StandaloneUpdater\\OneDriveSetup.exe","C:\\Windows\\regedit.exe","C:\\Windows\\hh.exe","C:\\Users\\*\\AppData\\Local\\Temp\\WindowsUpdateLog\\tracerpt.exe","C:\\Program Files\\Microsoft RDInfra\\StackSxS\\*\\rdpinit.exe","C:\\Program Files\\Microsoft RDInfra\\StackSxS\\*\\rdpshell.exe","C:\\Windows\\Temp\\*\\DismHost.exe")
# FilePath1: "C:\\Program Files\\Common Files\\microsoft shared\\MSInfo\\msinfo32.exe"
# FilePath2: "C:\\Users\\*\\AppData\\Local\\Temp\\*\\DismHost.exe"   - https://www.file.net/process/dismhost.exe.html
# FilePath3: "C:\\Users\\*\\AppData\\Local\\Microsoft\\OneDrive\\Update\\OneDriveSetup.exe"
# FilePath4: "C:\\Users\\*\\AppData\\Local\\Microsoft\\OneDrive\\StandaloneUpdater\\OneDriveSetup.exe" - 
# FilePath5: "C:\\Windows\\regedit.exe"     - Windows Registry Edit process
# FilePath6: "C:\\Windows\\hh.exe"          - HTML Helper - Not a virus (https://www.file.net/process/hh.exe.html)
# FilePath7: "C:\\Users\\*\\AppData\\Local\\Temp\\WindowsUpdateLog\\tracerpt.exe")
iseval = 0

[cs_common_ransomware_extensions_internal_filter]
definition = search NOT file_path IN ("C:\\ProgramData\\Microsoft\\Windows Defender\\IMpService*.lock","C:\\Users\\*\\AppData\\Roaming\\Code\\CachedData\\*\\*.code","C:\\Users\\*\\AppData\\Roaming\\Cisco\\Unified Communications\\Jabber\\CSF\\Security\\AppDialRules.xml.adr","C:\\Program Files\\Microsoft SQL Server\\MSSQL*.SQLEXPRESS\\PYTHON_SERVICES.*\\Library\\lib\\tcl*\\encoding\\*.enc","C:\\Program Files\\Microsoft SQL Server\\MSSQL*.SQLEXPRESS\\PYTHON_SERVICES.*\\tcl\\tcl*\\encoding\\*.enc")
iseval = 0

[cs_ransomware_min_file_writes]
definition = 20

[cs_ransomware_min_file_extension_count]
definition = 10


# Splunk Admin
[cs_splunk_admin_missing_indexes_internal_filter]
definition = search NOT index IN ("cyences", "audit_summary", "endpoint_summary", "gia_summary", "notable", "cim_modactions", "risk")
iseval = 0


# Sysmon Deploy Audit
[cs_sysmon_deploy_audit_data]
definition = index=windows sourcetype="InstallLog:Sysmon"
iseval = 0


# Configuration for AD Object Changes
##-- All Changes for Category--##
[ms_obj_changes_base_cat(1)]
args = tok_chg_cat
definition = `cs_wineventlog_security` [|inputlookup cs_ad_audit_change_event_codes WHERE change_category="$tok_chg_cat$" |stats values(EventCode) AS EventCode,values(obj_type) AS obj_type | format] src_user_type="user" NOT((EventCode=4723 OR EventCode=4738) AND src_user!=user)
iseval = 0

[ms_obj_group_change_out]
definition = fields _time, _raw, src_user, src_nt_domain, dest_nt_domain, msad_action, signature,DN,New_DN,Old_DN,group_obj_lkp,member_obj_lkp,MSADGroupClass,MSADGroupClassID,MSADGroupType,MSADChanges,MSADChangedAttributes,AttributeLDAPDisplayName,AttributeValue,dir_svcs_action \
| eval msad_action=if(isnull(msad_action),if(isnull(dir_svcs_action),"NA",dir_svcs_action),if(isnull(dir_svcs_action),msad_action,msad_action." (".dir_svcs_action.")"))\
| eval adminuser=if(isnull(src_nt_domain),src_user,upper(src_nt_domain)."\\".src_user)\
| lookup cs_ad_audit_group_type MSADGroupClassID OUTPUT MSADGroupClass\
| lookup cs_ad_obj_group lookup_grp AS group_obj_lkp OUTPUT cn AS group_obj_cn, orig_cn AS group_obj_o_cn,MSADGroupClass AS MSADGroupClass_u, MSADGroupType AS MSADGroupType_u\
| eval group_obj_nm=if(isnull(group_obj_o_cn) OR group_obj_o_cn="",if(isnull(group_obj_cn) OR group_obj_cn="",if(isnull(group_obj_lkp),"NA",group_obj_lkp),lower(group_obj_cn)),lower(group_obj_o_cn))\
| eval MSADGroupClass=if(isnull(MSADGroupClass),if(isnull(MSADGroupClass_u),"NA",MSADGroupClass_u),MSADGroupClass)\
| eval MSADGroupType=if(isnull(MSADGroupType),if(isnull(MSADGroupType_u),"NA",MSADGroupType_u),MSADGroupType)\
| fillnull value="N/A" Correlation_ID,member_obj_lkp\
| `ms_obj_msad-changed-attributes`\
| stats list(MSADChanges) AS MSADChanges,values(Correlation_ID) AS Correlation_IDs by _time,adminuser,msad_action,group_obj_nm,MSADGroupType,MSADGroupClass,member_obj_lkp,signature\
| eval MSADChanges=mvjoin(MSADChanges, "########")\
| eval MSADChanges=case(isnull(signature) AND isnull(MSADChanges),"Unknown Changes",isnull(signature),MSADChanges,isnotnull(MSADChanges),"Signature: ".signature."########".MSADChanges)\
| makemv delim="########" MSADChanges\
| table _time, adminuser, group_obj_nm,msad_action,MSADGroupType,MSADGroupClass,member_obj_lkp,MSADChanges
iseval = 0

[ms_obj_msad-changed-attributes]
definition = fillnull value="" signature,Correlation_IDs\
| eval f=replace(MSADChangedAttributes, "(?msi)\r\s+|\n\s+", "########")\
| makemv delim="########" f\
| eval MSADChangedAttributes=mvfilter(NOT match(f, ":(\s*\-\s*|)$")) \
| eval MSADChanges=if(isnull(MSADChangedAttributes),if(isnull(AttributeLDAPDisplayName),if(msad_action="moved","Moved:########--From: ".Old_DN."########--To: ".New_DN,""),if(isnull(AttributeValue) OR AttributeValue="-" OR AttributeValue="",NULL,dir_svcs_action." (".AttributeLDAPDisplayName.": ".AttributeValue.")")),MSADChangedAttributes)
iseval = 0

[ms_obj_user_change_out]
definition = fields _time, src_user, user, user_obj_dn, user_obj_email,msad_action, MSADChanges, dest_nt_domain, signature, MSADChangedAttributes,Correlation_ID,AttributeLDAPDisplayName,AttributeValue,DN,Old_DN,New_DN,dir_svcs_action\
| eval adminuser=if(isnull(src_nt_domain),src_user,upper(src_nt_domain)."\\".src_user)\
| eval user_obj_lkp=if(isnull(user_obj_dn),if(isnull(user_obj_email),if(isnull(DN),if(isnull(Old_DN),if(isnull(New_DN),lower(user),lower(New_DN)),lower(Old_DN)),lower(DN)),lower(user_obj_email)),lower(user_obj_dn))\
| lookup cs_ad_obj_user lookup_usr AS user_obj_lkp OUTPUT sAMAccountName AS b_user_obj_sam,cn AS b_user_obj_cn\
| eval user=if(isnull(b_user_obj_sam),if(isnull(b_user_obj_cn),if(isnull(user_obj_lkp),"NA",lower(user_obj_lkp)),lower(b_user_obj_cn)),lower(b_user_obj_sam))\
| eval dest_user_subject=if(isnull(dest_nt_domain),user,dest_nt_domain."\\".lower(user))\
| `ms_obj_msad-changed-attributes`\
| stats count, values(Correlation_ID) AS Correlation_IDs,values(MSADChanges) AS MSADChanges by _time,adminuser,msad_action,dest_user_subject,user,signature\
| eval signature=mvdedup(signature)\
| eval MSADChanges=mvjoin(MSADChanges, "########")\
| eval MSADChanges=case(isnull(signature) AND isnull(MSADChanges),"Unknown Changes",isnull(signature),MSADChanges,isnull(MSADChanges),"Signature: ".signature,isnotnull(MSADChanges),"Signature: ".signature."########".MSADChanges)\
| makemv delim="########" MSADChanges\
| table _time,adminuser,msad_action,user,dest_user_subject,Correlation_IDs,MSADChanges
iseval = 0

# ================================== #
# Update below macros based on your environment #
# ================================== #

# Data-Models
[cs_summariesonly_endpoint]
definition = summariesonly=false
iseval = 0

[cs_summariesonly_network_traffic]
definition = summariesonly=false
iseval = 0

[cs_summariesonly_authentication]
definition = summariesonly=false
iseval = 0


# General
[cs_home_country]
definition = "United States"
# Quotes around the name of the country is compulsory.


# Windows/AD
[cs_wineventlog_security]
definition = index IN (wineventlog, windows, msad) sourcetype="*WinEventLog" source="*WinEventLog:Security"
iseval = 0

[cs_wineventlog_system]
definition = index IN (wineventlog, windows, msad) sourcetype="*WinEventLog" source="*WinEventLog:System"
iseval = 0

[cs_ad_active_directory]
definition = index IN (wineventlog, windows, msad) sourcetype="ActiveDirectory"
iseval = 0

[cs_ad_health_logs]
definition = index IN (wineventlog, windows, msad) source=powershell sourcetype="MSAD:*:Health"
iseval = 0

[cs_ad_user_modification_filter]
definition = search *
iseval = 0

[cs_ad_user_privilege_escalation_filter]
definition = search *
iseval = 0

[cs_ad_group_changed_filter]
definition = search *
iseval = 0

[cs_ad_group_policy_changed_filter]
definition = search *
iseval = 0

[cs_ad_user_changed_filter]
definition = search *
iseval = 0

[cs_ad_user_locked_out_filter]
definition = search *
iseval = 0

[cs_ad_password_change_outside_working_hour_definition]
definition = where date_wday="Saturday" OR date_wday="Sunday" OR date_hour<6 OR date_hour>19
iseval = 0

[cs_ad_password_change_outside_working_hour_filter]
definition = search *
iseval = 0

[cs_windows_host_missing_update_filter]
definition = search *
iseval = 0

[cs_windows_firewall_disabled_filter]
definition = search *
iseval = 0

[cs_windows_wmi_lateral_movement_filter]
definition = search *
iseval = 0

[cs_windows_event_log_cleared_filter]
definition = search *
iseval = 0

[cs_windows_process_tampering_filter]
definition = search *
iseval = 0


# Sysmon
[cs_sysmon]
definition = index=epintel sourcetype="*wineventlog"
iseval = 0


# Ransomware
[cs_ransomware_extensions]
definition = lookup update=true ransomware_extensions_lookup Extensions AS file_extension OUTPUT Name AS Ransomware_Name | search Ransomware_Name!=False 
iseval = 0

[cs_spike_in_file_writes_filter]
definition = search *
iseval = 0

[cs_system_processes_run_from_unexpected_locations_filter]
definition = search *
iseval = 0

[cs_common_ransomware_extensions_filter]
definition = search *
iseval = 0

[cs_common_ransomware_notes_filter]
definition = search *
iseval = 0

[cs_usn_journal_deletion_filter]
definition = search *
iseval = 0

[cs_scheduled_tasks_used_in_badrabbit_ransomware_filter]
definition = search *
iseval = 0


# O365
[cs_o365]
definition = index=o365
iseval = 0

[cs_o365_success_login_outside_country_filter]
definition = search *
iseval = 0

[cs_o365_failed_login_outside_country_filter]
definition = search *
iseval = 0

[cs_o365_login_by_unknown_userid_filter]
definition = search *
iseval = 0

[cs_o365_dlp_exchange_filter]
definition = search *
iseval = 0

[cs_o365_dlp_sharepoint_filter]
definition = search *
iseval = 0

[cs_o365_external_users_filter]
definition = search *
iseval = 0

[cs_o365_service_not_operational_filter]
definition = search *
iseval = 0

# Networking
[cs_scanning_basic_scanning_filter]
definition = search *
iseval = 0

[cs_tor_traffic_filter]
definition = search *
iseval = 0

[cs_network_home_location_lat]
definition = 41.881832
iseval = 0

[cs_network_home_location_lon]
definition = -87.623177
iseval = 0

[cs_network_traffic_map_filter]
definition = search *
iseval = 0

[cs_network_scanning_map_filter]
definition = search *
iseval = 0


# Palo Alto Firewall
[cs_palo]
definition = index=pan_log
iseval = 0

[cs_palo_dns_sinkhole_filter]
definition = search *
iseval = 0

[cs_palo_high_threats_alert_filter]
definition = search *
iseval = 0

[cs_palo_high_system_alerts_filter]
definition = search *
iseval = 0

[cs_palo_wildfire_filter]
definition = search *
iseval = 0

[cs_palo_ddos_prevented_filter]
definition = search *
iseval = 0

[cs_palo_firewall_login_failure_filter]
definition = search *
iseval = 0

[cs_palo_search_blocked_ip_lookup_name]
definition = ip_blocked_list
# Use ip_range_blocked_list lookup if you have blocked ip list with IP CIDR (range) in the lookup
# Lookups must have two fields ip and blocked
# ip - Blocked IP or IP range (CIDR)
# blocked - 1 (all the list is blocked IPs so, keep value as 1)
iseval = 0

[cs_palo_blocked_ip_inbound_filter]
definition = search *
iseval = 0

[cs_palo_blocked_ip_outbound_filter]
definition = search *
iseval = 0

[cs_palo_malicious_ip_list_filter_old_results]
definition = `cs_palo_malicious_ip_list_filter_previous_results("-7d@h")`
# Change the value to keep values in the malicious IP list for longer or shorter time period, the default value is -7d@h (last 7 days)
iseval = 0

[cs_palo_malicious_ip_list_filter]
definition = search *
iseval = 0


# Sophos Central
[cs_sophos]
definition = index=sophos
iseval = 0

[cs_sophos_update_errors_filter]
definition = search *
iseval = 0

[cs_sophos_endpoint_not_protected_filter]
definition = search *
iseval = 0

[cs_sophos_endpoint_outofdate_filter]
definition = search *
iseval = 0

[cs_sophos_realtime_protection_disabled_filter]
definition = search *
iseval = 0

[cs_sophos_service_not_running_filter]
definition = search *
iseval = 0

[cs_sophos_failed_to_cleanup_threat_filter]
definition = search *
iseval = 0

[cs_sophos_core_restore_failed_filter]
definition = search *
iseval = 0

[cs_sophos_expiration_messages_filter]
definition = search *
iseval = 0

[cs_sophos_exploit_prevented]
definition = search *
iseval = 0

[cs_sophos_malware_detected]
definition = search *
iseval = 0


# Windows Defender
[cs_windows_defender]
definition = index=windefender
iseval = 0

[cs_windows_defender_max_timerange]
definition = earliest=-24h@h latest=now
iseval = 0

[cs_windows_defender_endpoint_not_protected]
definition = search *
iseval = 0

[cs_windows_defender_realtime_protection_disabled_filter]
definition = search *
iseval = 0

[cs_windows_defender_update_errors_filter]
definition = search *
iseval = 0

[cs_windows_defender_antivirus_expired_filter]
definition = search *
iseval = 0

[cs_windows_defender_antivirus_dropped_support_for_os_filter]
definition = search *
iseval = 0

[cs_windows_defender_antivirus_will_expired_filter]
definition = search *
iseval = 0

[cs_windows_defender_antivirus_will_dropped_support_for_os_filter]
definition = search *
iseval = 0

[cs_windows_defender_antivirus_scan_failed_filter]
definition = search *
iseval = 0

[cs_windows_defender_unable_to_download_offline_scan_filter]
definition = search *
iseval = 0

[cs_windows_defender_malware_detected_filter]
definition = search *
iseval = 0


# Crowdstrike
[cs_crowdstrike_eventstream]
definition = index=crowdstrike sourcetype="CrowdStrike:Event:Streams:JSON"
iseval = 0

[cs_crowdstrike_malware_detected_alert_filter]
definition = search *
iseval = 0

[cs_crowdstrike_malware_detected_report_filter]
definition = search *
iseval = 0

[cs_crowdstrike_malware_prevented_filter]
definition = search *
iseval = 0


# Credential Compromise
[cs_attempted_credential_dump_from_registry_via_reg_exe_filter]
definition = search *
iseval = 0

[cs_detect_credential_dumping_through_lsass_access_filter]
definition = search *
iseval = 0

[cs_credential_dumping_via_symlink_to_shadow_copy_filter]
definition = search *
iseval = 0

[cs_credential_dumping_via_copy_command_from_shadow_copy_filter]
definition = search *
iseval = 0


# VPN
[cs_vpn_indexes]
definition = index=pan_log
# Default value pan_log represents for Global protect VPN
iseval = 0

[cs_vpn_dashboard_filter]
definition = search *
iseval = 0


# Authentication
[cs_authentication_indexes]
definition = index=*
iseval = 0

[cs_authentication_app_filter]
definition = Authentication.app=*
# Apply filter on Authentication.app field (tstats where condition filter format, you can use !=, =, OR and AND condition)
iseval = 0

[cs_authentication_bruteforce_attempt_limit]
definition = 100
iseval = 0

[cs_authentication_bruteforce_attempt_for_user_filter]
definition = search *
iseval = 0

[cs_authentication_bruteforce_attempt_from_source_filter]
definition = search *
iseval = 0

[cs_authentication_excessive_vpn_login_failure_limit]
definition = 20
iseval = 0

[cs_authentication_excessive_vpn_login_failure_for_user_filter]
definition = search *
iseval = 0

[cs_authentication_excessive_vpn_login_failure_from_source_filter]
definition = search *
iseval = 0



# Splunk Admin
[cs_splunk_admin_missing_indexes_filter]
definition = search *
iseval = 0

[cs_splunk_admin_missing_forwarders_filter]
definition = search *
iseval = 0


# Lansweeper
[cs_lansweeper]
definition = index=lansweeper
iseval = 0

[cs_lansweeper_timerange]
definition = earliest=-4h@h latest=now
iseval = 0

[cs_wineventlog_security_timerange]
definition = earliest=-4h@h latest=now
iseval = 0

[cs_wineventlog_system_timerange]
definition = earliest=-4h@h latest=now
iseval = 0

[cs_sysmon_timerange]
definition = earliest=-4h@h latest=now
iseval = 0


# Qualys
[cs_qualys]
definition = index=qualys sourcetype="qualys:*"
iseval = 0

[cs_qualys_timerange]
definition = earliest=-7d@h latest=now
iseval = 0

[cs_qualys_linux_os]
definition = ("*Ubuntu*", "*Linux*", "*CentOS*")
iseval = 0


# Tenable
[cs_tenable]
definition = index=tenable
iseval = 0
