# Instruction
# 1. Copy this [cyences_stash] stanza from default directory of the Cyences App into local directory's props.conf file.
# 2. Update stanza name from [cyences_stash] to [stash] in the local version of props.conf

[cyences_stash]
# Data under cyences index, auto summaries stored by savedsearches/alerts will be present with stash sourcetype. This sourcetype will not be counted under licensing.
# Remove these fields as lookup from SA-IdentityManagement/local/props.conf's [default] stanza 
# is generating unnecessary fields on the ES SH
EVAL-orig_dest = dest
EVAL-orig_dvc = dvc
EVAL-orig_src = src
EVAL-orig_src_user = src_user
EVAL-orig_user = user

EVAL-dest = if(isnotnull(category), null(), dest)
EVAL-dvc = if(isnotnull(category), null(), dvc)
EVAL-src = if(isnotnull(category), null(), src)
EVAL-src_user = if(isnotnull(category), null(), src_user)
EVAL-user = if(isnotnull(category), null(), user)



####################
## Cyences Logger ##
####################
[source::.../var/log/splunk/cyences_*.log*]
SHOULD_LINEMERGE = false
LINE_BREAKER=([\r\n]+)\d{4}-\d{2}-\d{2}
sourcetype = cyences:logs


######################
## Windows Defender ##
######################
[source::XmlWinEventLog:Microsoft-Windows-Windows Defender/Operational]
# Support for Windows 10 event logs for defender
EVAL-AVSignature_version = coalesce(AVSignature_version, AV_security_intelligence_version)
EVAL-AV_signature_creation_time = coalesce(AV_signature_creation_time, AV_security_intelligence_creation_time)


######################
#### O365 ############
######################
[o365:management:activity]
EVAL-action = case(isnotnull(action),action,(Operation == "UserLoginFailed"),"failure",(Operation == "UserLoggedIn"),"success")


######################
### Global Protect ###
######################
# For new Palo Alto version's (Jan/Feb 2021) Global Protect data
[pan:globalprotect]
EVAL-src = coalesce(src, src_ip)
EVAL-action = coalesce(action, status)
EVAL-dest = if(((log_subtype="login") AND (((event_id="portal-auth" OR event_id="gateway-auth") AND (action="failure" OR status="failure")) OR (event_id="gateway-register" AND (action="success" OR status="success")))), "vpn_auth", dest)

# Logic for login success on Palo Alto App (New Version of Global Protect)
# Success - log_subtype="connected"
# Failure - result="failure"

# Logic Here (New Version of Global Protect)
# Success - (event_id="gateway-register") action="success"
# Failure - (event_id="portal-auth" OR event_id="gateway-auth") action="failure"


# NEW # sourcetype="pan:globalprotect"
# =====================================
# log_subtype and event_id
# ------
# login	        gateway-auth
# configuration	gateway-config-release
# connected	    gateway-connected
# login	        gateway-gen-cookie
# configuration	gateway-getconfig
# host-info	    gateway-hip-check
# host-info	    gateway-hip-report
# logout	    gateway-logout
# before-login	gateway-prelogin
# login       	gateway-register
# tunnel	    gateway-setup-ipsec
# tunnel      	gateway-tunnel-latency
# login	        portal-auth
# login       	portal-gen-cookie
# configuration	portal-getconfig
# before-login	portal-prelogin


# Backward compatibility (Legacy Palo Alto (Global Protect) Version)
[pan:system]
EVAL-dest = if(log_subtype="globalprotect" AND (event_id="globalprotectportal-auth-fail" OR event_id="globalprotectgateway-auth-fail" OR event_id="globalprotectgateway-regist-succ"), "vpn_auth", dest)

# Logic for login success on Palo Alto App (Legacy Version of Global Protect)
# Success - 
#         On Login by User panel - event_id="globalprotectgateway-auth-succ"
#         On Login/Logout Events panel - event_id="globalprotectgateway-regist-succ"
# Failure - event_id="globalprotectportal-auth-fail"

# Logic Here (Legacy Version of Global Protect)
# Success - event_id="globalprotectgateway-regist-succ"
# Failure - (event_id="globalprotectportal-auth-fail" OR event_id="globalprotectgateway-auth-fail")


# OLD # sourcetype="pan:system" log_subtype="globalprotect"
# ===========================================================
# event_id
# ----------
# globalprotectgateway-auth-fail
# globalprotectgateway-auth-succ
# globalprotectgateway-config-release
# globalprotectgateway-config-succ
# globalprotectgateway-gencookie-succ
# globalprotectgateway-logout-succ
# globalprotectgateway-regist-fail
# globalprotectgateway-regist-succ
# globalprotectgateway-switch-succ
# globalprotectportal-auth-fail
# globalprotectportal-auth-succ
# globalprotectportal-config-succ
# globalprotectportal-gencookie-succ


# Sophos
[sophos:central:events]
EVAL-user = coalesce(user, suser)
FIELDALIAS-src_ip = "source_info.ip" AS src_ip



# WinEventLog Security Logs - XML format
[source::XmlWinEventLog:Security]
# wineventlog cleared
EXTRACT-user = <SubjectUserName>(?<user>[^<]+)</SubjectUserName>
EVAL-LogName = if((EventCode=1100 OR EventCode=1102), "Audit-Security", LogName)
EVAL-user = coalesce(User, user, "-")

# Configuration for AD Object Changes
REPORT-obj_type_from_xml = cs_object_class_as_obj_type
REPORT-obj_dn_from_xml = ObjectDN_as_DN
REPORT-obj_guid_from_xml = ObjectGUID_as_objectGUID
REPORT-obj_old_dn_from_xml = OldObjectDN_as_Old_DN
REPORT-obj_new_dn_from_xml = NewObjectDN_as_New_DN
REPORT-obj_corr_id_from_xml = OpCorrelationID_as_Correlation_ID
EVAL-msad_action = if(msad_action=="changed","modified",msad_action)
REPORT-ldap_display_name_from_xml = AttributeLDAPDisplayName_as_LDAP_Display_Name
EXTRACT-cs_obj_dir_src_user_nm = (?si)(?:SubjectUserName\'\>(?!\-)(?<src_user>[^\<]+))
EXTRACT-cs_obj_xml_src_domain = (?si)(?:SubjectDomainName\'\>(?!\-)(?<src_nt_domain>[^\<]+))
EXTRACT-cs_obj_xml_user_nm = (?si)(?:TargetUserName\'\>(?!\-)(?<user>[^\<]+))
EXTRACT-cs_obj_xml_dest_domain = (?si)(?:TargetDomainName\'\>(?!\-)(?<dest_nt_domain>[^\<]+))
EXTRACT-cs_obj_xml_dest_domain_ds = (?si)(?:DSName\'\>(?!\-)(?<dest_nt_domain>[^\.]+)\..*\<)
EXTRACT-cs_obj_xml_user_obj_guid = (?si)(?:(ObjectGUID)\'\>\{(?<user_obj_guid>[^\}]+))\}.*?\'ObjectClass\'\>user\<
EXTRACT-cs_obj_xml_user_obj_dn = (?si)(?:(ObjectDN|NewObjectDN)\'\>(?<user_obj_dn>[^\<]+))\<.*?\'ObjectClass\'\>user\<
EXTRACT-cs_obj_xml_comp_obj_guid = (?si)(?si)(?:(ObjectGUID)\'\>\{(?<computer_obj_guid>[^\}]+))\}.*?\'ObjectClass\'\>computer\<
EXTRACT-cs_obj_xml_comp_obj_dn = (?si)(?:(ObjectDN|NewObjectDN)\'\>(?<computer_obj_dn>[^\<]+))\<.*?\'ObjectClass\'\>computer\<
EXTRACT-cs_obj_xml_group_obj_guid = (?si)(?:(ObjectGUID)\'\>\{(?<group_obj_guid>[^\}]+))\}.*?\'ObjectClass\'\>group\<
EXTRACT-cs_obj_xml_group_obj_dn = (?si)(?:(ObjectDN|NewObjectDN)\'\>(?<group_obj_dn>[^\<]+))\<.*?\'ObjectClass\'\>group\<
EXTRACT-cs_obj_xml_member_obj_dn = (?si)(?:\'ObjectClass\'\>group\<\/Data\>\<Data Name\=\'AttributeLDAPDisplayName\'\>member\<).*(?:\'AttributeValue\'\>)(?<member_obj_dn>[^\<]+)
EXTRACT-cs_obj_xml_ou_obj_guid = (?si)(?:(ObjectGUID)\'\>\{(?<ou_obj_guid>[^\}]+))\}.*?\'ObjectClass\'\>organizationalUnit\<
EXTRACT-cs_obj_xml_ou_obj_dn = (?si)(?:(ObjectDN|NewObjectDN)\'\>(?<ou_obj_dn>[^\<]+))\<.*?\'ObjectClass\'\>organizationalUnit\<
EXTRACT-cs_obj_xml_chg_gp_guid = (?si)(?:AttributeLDAPDisplayName\'\>gPLink).*?cn\=\{(?<chg_gp_guid>[^\}]+)
EXTRACT-cs_obj_xml_gpo_obj_guid = (?si)(?:(ObjectGUID)\'\>\{(?<gpo_obj_guid>[^\}]+))\}.*?\'ObjectClass\'\>groupPolicyContainer\<
EXTRACT-cs_obj_xml_gpo_obj_cn = (?si)(?:(ObjectDN)\'\>CN\=\{(?<Object_Name_Guid>[^\}]+))\}.*?\'ObjectClass\'\>groupPolicyContainer\<
EXTRACT-cs_obj_xml_sourcename = (?msi)\<Provider\sName\=\'(?<SourceName>[^\']+)
EXTRACT-cs_obj_xml_logname_from_channel=(?msi)(?:\<Channel\>)(?<LogName>[^\<]+)
EXTRACT-cs_obj_xml_install_product = (?msi)(?:\>(1033|1042|1040)\<\/EventID\>).*(?:\<EventData\>)\<Data\>(|(?<product_name>[^\<]+))\<\/Data\>\<Data\>(|(?<product_version>[^\<]+))\<\/Data\>\<Data\>(|(?<product_language>[^\<]+))\<\/Data\>\<Data\>(|(?<product_client_id>[^\<]+))\<\/Data\>\<Data\>(|(?<product_manufacturer>[^\<]+))\<\/Data\>\<Data\>
EXTRACT-cs_obj_xml_product_name=(?msi)(?:(\<Application\>|Product|Produkt)(\:|\sName\:))(?<product_name>[^(\<|\.|\-)]+)
EXTRACT-cs_obj_xml_1022_product_info=(?:\>(1022)\<\/EventID\>).*(?:\<EventData\>\<Data\>)(|(?<product_name>[^\<]+))\<\/Data\>\<Data\>(|(?<product_update>[^\<]+))\<\/Data\>
EXTRACT-cs_obj_xml_1035_6_product_info=| rex "(?:\>(1034|1035)\<\/EventID\>).*(?:\<EventData\>\<Data\>)(|(?<product_name>[^\<]+))\<\/Data\>\<Data\>(|(?<product_version>[^\<]+))\<\/Data\>\<Data\>(|(?<product_language>[^\<]+))\<\/Data\>\<Data\>(|(?<product_status>[^\<]+))\<\/Data\>\<Data\>(|(?<product_manufacturer>[^\<]+))
EXTRACT-cs_obj_xml_1005_6_product_name=(?msi)(?:EventCode\=(1005|1006)).*(?:Message\=)(?<product_name>[^\s\-]+)\s\-(?<install_msg>[^$]+)
EXTRACT-cs_obj_xml_1036_product_info=(?:\>1036\<\/EventID\>).*(?:\<EventData\>\<Data\>)(|(?<product_name>[^\<]+))\<\/Data\>\<Data\>(|(?<product_version>[^\<]+))\<\/Data\>\<Data\>(|(?<product_language>[^\<]+))\<\/Data\>\<Data\>(|(?<product_update>[^\<]+))\<\/Data\>\<Data\>(|(?<product_status>[^\<]+))\<\/Data\>\<Data\>(|(?<product_manufacturer>[^\<]+))
EXTRACT-cs_obj_xml_nApps=(?:\<nApplications\>)(?<n_apps>[^\<]+)
LOOKUP-cs_obj_changes = cs_ad_audit_change_event_codes EventCode AS EventCode OUTPUTNEW change_action AS msad_action change_category AS change_category obj_type AS obj_type signature AS change_signature
LOOKUP-cs_obj_changes_adv = cs_ad_audit_change_event_codes EventCode AS EventCode obj_type AS obj_type OUTPUTNEW change_action AS msad_action change_category AS change_category obj_type AS obj_type signature AS change_signature
EVAL-user_type = case(match(user,"\$(\,|\@|$)"),"computer",match(user,"SYSTEM|NoGuestsAllowed|ANONYMOUS|NT AUTHORITY|DWM-|LOCAL SERVICE|NETWORK SERVICE"),"system",isnotnull(user),"user")
EVAL-src_user_type = case(match(src_user,"\$(\,|\@|$)"),"computer",match(src_user,"SYSTEM|NoGuestsAllowed|ANONYMOUS|NT AUTHORITY|DWM-|LOCAL SERVICE|NETWORK SERVICE"),"system",isnotnull(src_user),"user")
EVAL-user_obj_email = if(isnull(user_obj_email),if(match(user,"(?=.{1,64}@\S)"),lower(user),if(isnull(User_Principal_Name),NULL,lower(User_Principal_Name))),lower(user_obj_email))
EVAL-dir_svcs_action = if(OperationType="%%14674","Value Added",if(OperationType="%%14675","Value Deleted","Unknown"))
EVAL-member_obj_class = replace(member_obj_class,"^.*\|","")
EVAL-group_obj_ldap_v = if(ObjectClass=="group",LDAP_Display_Name."|".Value,NULL)
EVAL-user_obj_ldap_v = if(ObjectClass=="user",LDAP_Display_Name."|".Value,NULL)
EVAL-gpo_obj_ldap_v = if(ObjectClass=="groupPolicyContainer",LDAP_Display_Name."|".Value,NULL)
EVAL-ou_obj_ldap_v = if(ObjectClass=="organizationalUnit",LDAP_Display_Name."|".Value,NULL)
EVAL-comp_obj_ldap_v = if(ObjectClass=="computer",LDAP_Display_Name."|".Value,NULL)
EVAL-Old_DN = lower(replace(Old_DN,"\x5C{1}",""))
EVAL-New_DN = lower(replace(New_DN,"\x5C{1}",""))
EVAL-DN = lower(replace(DN,"\x5C{1}",""))
EVAL-user_obj_dn = lower(replace(user_obj_dn,"\x5C{1}",""))
EVAL-group_dn = if(ObjectClass="group",lower(replace(ObjectDN,"\x5C{1}","")),lower(replace(group_dn,"\x5C{1}","")))
EVAL-user_group = lower(replace(user_group,"\x5C{1}",""))
EVAL-Group_Name = lower(replace(Group_Name,"\x5C{1}",""))
EVAL-group_obj_dn = lower(replace(group_obj_dn,"\x5C{1}",""))
EVAL-group_obj_id = lower(replace(group_obj_id,"\x5C{1}",""))
EVAL-group_obj_lkp=if(isnull(user_group),if(isnull(Group_Name),if(isnull(group_obj_dn),if(isnull(group_obj_id),if(isnull(group_dn),NULL,lower(replace(group_dn,"\x5C{1}",""))),lower(replace(group_obj_id,"\x5C{1}",""))),lower(replace(group_obj_dn,"\x5C{1}",""))),lower(replace(Group_Name,"\x5C{1}",""))),lower(replace(user_group,"\x5C{1}","")))
EVAL-comp_obj_dn = lower(replace(comp_obj_dn,"\x5C{1}",""))
EVAL-comp_obj_sam = lower(replace(comp_obj_dn,"\x5C{1}",""))
EVAL-ou_obj_dn = lower(replace(ou_obj_dn,"\x5C{1}",""))
EVAL-cn = if(isnull(cn),name,if(match("\x5C{1}",cn),replace(cn,"\x5C{1}",""),cn))
EVAL-distinguishedName = lower(replace(distinguishedName,"\x5C{1}",""))
EVAL-member_obj_dn = lower(replace(member_obj_dn,"\x5C{1}",""))
EVAL-member_obj_sam = if(isnull(member_obj_sam),if(isnull(member_obj_secid),lower(replace(member_obj_dn,"\x5C{1}","")),lower(member_obj_secid)),lower(replace(member_obj_sam,"\x5C{1}","")))
EVAL-member_obj_cn = lower(replace(member_obj_cn,"\x5C{1}",""))
EVAL-member_obj_id = case(isnull(member_obj_sam) AND isnotnull(member_obj_cn),lower(replace(member_obj_cn,"\x5C{1}","")),match(member_obj_sam,"(?i)^CN\="),lower(replace(member_obj_cn,"\x5C{1}","")),isnotnull(member_obj_sam) AND NOT match(member_obj_sam,"(?i)^CN\="),lower(replace(member_obj_sam,"\x5C{1}","")),isnull(member_obj_sam) AND isnull(member_obj_cn),lower(replace(member_obj_dn,"\x5C{1}","")))
EVAL-member_obj_lkp = if(isnull(member_obj_dn),if(isnull(member_obj_cn),if(isnull(member_obj_id),if(isnull(member_obj_sam),NULL,lower(replace(member_obj_sam,"\x5C{1}",""))),lower(replace(member_obj_id,"\x5C{1}",""))),lower(replace(member_obj_cn,"\x5C{1}",""))),lower(replace(member_obj_dn,"\x5C{1}","")))
EVAL-obj_type = lower(obj_type)


# WinEventLog Security Logs - Plain text format
[source::WinEventLog:Security]
# wineventlog cleared
EVAL-LogName = if((EventCode=1100 OR EventCode=1102), "Audit-Security", LogName)
EVAL-user = coalesce(User, user, "-")

# Windows firewall disabled events
EVAL-SettingType = if(EventCode=4950 AND isnull(SettingType), mvfilter(Type!="Information"), SettingType)
EVAL-SettingValue = if(EventCode=4950 AND isnull(SettingValue), Value, SettingValue)
EVAL-ProfileChanged = if(EventCode=4950 AND isnull(ProfileChanged), Changed_Profile, ProfileChanged)

# Configuration for AD Object Changes
EXTRACT-cs_obj_src_user = (?msi)(?:Account\s+Name\:(?!\s+(\r|\n))(?!\s+(\-|\r|\n))(?!\s+(\S+\$|\r|\n))(?<src_user>[^(\r|\n)]+))
EXTRACT-cs_obj_user = (?msi)(?:Account\s+Name\:.*?(Account\s+Name\:)|(?:Account\s+Name\:))(?!\s+(\-|\r\n))(?!\s+(\S+\$|\r|\n))\s+(?<user>[^(\r|\n)]+)
EXTRACT-cs_obj_comp_obj_sam = (?msi)(?:Account\s+Name\:.*?(Account\s+Name\:)|(?:Account\s+Name\:))(?!\s+(\-|\r\n))\s+(?<comp_obj_sam>[^(\r|\n)]+)(?<=\$)
EXTRACT-cs_obj_member_Account_Name_secid = (?msi)(?:Member\:)(.*?(Account\sName\:|Security ID:)(\s+(?<member_obj_domain>[^\x5C{1}]+)\x5C{1}|\s+)(?<member_obj_sam>[\S\-\S][^(\r|\n)]+)(\r|\n))
EXTRACT-cs_obj_member_obj_dn = (?msi)(?:Member\:).*?(Account\s+Name\:\s+(?<member_obj_dn>CN\=[^(\r|\n)]+))
EXTRACT-cs_obj_member_obj_cn_val = (?msi)(?:LDAP Display Name\:\s+member)(.*?Value\:)\s+CN=(?<member_obj_cn>.+?)(?<!\\),(?:(?:OU|CN|DC).+?(?<!\\),)+(DC.+?)(\s+|\n|\r)
EXTRACT-cs_obj_group_secid = (?msi)(?:New\sGroup\:|Group\:)(\s|\r|\n)(.*?Security ID:(\s+(?<group_obj_domain>[^\x5C{1}]+)\x5C{1}|\s+)(?<group_obj_id>[\S\-\S][^(\r|\n)]+)(\r|\n))
EXTRACT-cs_obj_group_nm_domain = (?msi)Group\:(\s|\r|\n)(.*?Group\sName\:\s+(?<group_obj_nm>[\S\-\S][^(\r|\n)]+)(\r|\n))(.*?Group\sDomain\:\s+(?<group_obj_domain>[\S\-\S][^(\r|\n)]+)(\r|\n))
EXTRACT-cs_obj_group_name_secid = (?msi)(?:New\sGroup\:|Group\:)(\s|\r|\n)(.*?Security ID:(\s+(?<group_obj_domain>[^\x5C{1}]+)\x5C{1}|\s+)(?<group_obj_id>[\S\-\S][^(\r|\n)]+)(\r|\n))
EXTRACT-cs_obj_src_nt_domain_Account_Domain = (?msi)(?:Account\s+Domain\:(?!\s+(\r|\n))\s+(?<src_nt_domain>[a-zA-Z0-9._[\S\-\S][^\r|\n]+))
EXTRACT-cs_obj_src_ip_Source_Network_Address = (?msi)Source Network Address:\s+?(?<src_ip>[^\n]+)
EXTRACT-cs_obj_dest_nt_domain_Account_Domain = (?msi)(Account\s+Domain\:.*?(Account\s+Domain\:)|Account\s+Domain\:)(?!\s+(\r|\n))\s+(?<dest_nt_domain>[a-zA-Z0-9._[\S\-\S][^\r|\n]+)
EXTRACT-cs_obj_dest_nt_domain_Group_Domain = (?msi)(Group\s+Domain\:.*?(Group\s+Domain\:)|Group\s+Domain\:)(?!\s+(\r|\n))\s+(?<dest_nt_domain>[a-zA-Z0-9._[\S\-\S][^\r|\n]+)
EXTRACT-cs_obj_objectGUID_GUID = GUID\:\s+\{(?<obj_GUID>[^\}]+)
EXTRACT-cs_obj_session_id = (?msi)(Logon\s+ID\:.*?(Logon\s+ID\:)|Logon\s+ID\:)(?!\s+(\r|\n))\s+(?<session_id>[a-zA-Z0-9._[\S\-\S][^\r|\n]+)
EXTRACT-cs_obj_object_type_group = (?msi)(?:Object Type\:\s+group(\s+|\n|\r).*?(Object\sName|DN)\:\s+(?<group_obj_dn>[^(\r|\n)]+))
EXTRACT-cs_obj_object_type_user = (?msi)(?:Object Type\:\s+user(\s+|\n|\r).*?(Object\sName|DN)\:\s+(?<user_obj_dn>[^(\r|\n)]+))
EXTRACT-cs_obj_object_type_ou = (?msi)(?:Object Type\:\s+organizationalUnit(\s+|\n|\r).*?(Object\sName|DN)\:\s+(?<ou_obj_dn>[^(\r|\n)]+))
EXTRACT-cs_obj_object_type_gpo = (?msi)(?:Object Type\:\s+groupPolicyContainer(\s+|\n|\r).*?(Object\sName|DN)\:\s+(?<gpo_obj_dn>[^(\r|\n)]+))
EXTRACT-cs_obj_object_type_computer = (?msi)(?:Object Type\:\s+computer(\s+|\n|\r).*?(Object\sName|DN)\:\s+(?<comp_obj_dn>[^(\r|\n)]+))
EXTRACT-cs_obj_type_class = (?msi)(?:Object(\sType\:|\:))(\s+|\n|\r)(?:.*Class\:)\s+(?<obj_type>[^(\r|\n)]+)
EXTRACT-cs_obj_type_only = (?msi)(?:Object Type\:(?!\s+(\r|\n))\s+(?<obj_type>[^(\r|\n)]+))
EXTRACT-cs_obj_type_taskcat = (?msi)(?:TaskCategory\=)(\s|)(Security|)(?<obj_type>[^\s]+)(\sAccount\s|\s)Management
EXTRACT-cs_obj_type_action = (?msi)(?:Message=A)\s(?<obj_type>[^\s]+)\s(account|type)\swas\s(?<msad_action>[^(\.|\s)]+)
EXTRACT-cs_obj_type_member = (?msi)(?:Message=A)\s+member\s+was\s+(?<msad_action>\S+)\s+(to|from)\s+a\s+(?<MSADGroupClass>\S+)\-(?<MSADGroupClassID>(enabled|disabled))\s(?<MSADGroupType>(\S+|\S+\s\S+))\s+(?<obj_type>group)\.
EXTRACT-cs_obj_type_group = (?msi)(?:Message=A)\s+(?<MSADGroupClass>\S+)\-(?<MSADGroupClassID>(enabled|disabled))\s(?<MSADGroupType>(\S+|\S+\s\S+))\s(?<obj_type>group)\swas\s(?<msad_action>[^\.]+)\.
EXTRACT-cs_obj_dir_svcs_user_obj_dn = (?msi)(?:Object\:)(.*?DN\:\s+)(?<user_obj_dn>[^\r|\n]+)(.*?Class\:\s+user)
EXTRACT-cs_obj_dir_svcs_comp_obj_dn = (?msi)(?:Object\:)(.*?DN\:\s+)(?<comp_obj_dn>[^\r|\n]+)(.*?Class\:\s+computer)
EXTRACT-cs_obj_dir_svcs_group_obj_dn = (?msi)(?:Object\:)(.*?DN\:\s+)(?<group_obj_dn>[^\r|\n]+)(.*?Class\:\s+group)(\r|\n)
EXTRACT-cs_obj_dir_svcs_gpo_obj_dn = (?msi)(?:Object\:)(.*?DN\:\s+)(?<gpo_obj_dn>[^\r|\n]+)(.*?Class\:\s+groupPolicyContainer)(\r|\n)
EXTRACT-cs_obj_dir_svcs_ou_obj_dn = (?msi)(?:Object\:)(.*?DN\:\s+)(?<ou_obj_dn>[^\r|\n]+)(.*?Class\:\s+organizationalUnit)
EXTRACT-cs_obj_dir_svcs_changes_object_guid = (?msi)(Object Type\:|Object\:)(\s+|\n|\r).*(Object\sName|DN)\:\s+CN(=\"|=\{)(?<Object_Name_Guid>[^(\"|\})]+)
EXTRACT-cs_obj_dir_svcs_mb_user_obj_dn = (?msi)(?:LDAP Display Name\:\s+member)(.*?Value\:)\s+(?<member_obj_dn>CN[^(\r|\n)]+)
EXTRACT-cs_obj_dir_svcs_changes_msad_action = (?msi)Message\=A\sdirectory\sservice\sobject\swas\s(?<msad_action>[^\.]+)
REPORT-cs_obj_cs_changed_attributes = cs_obj_cs_changed_attributes_values
EXTRACT-cs_obj_cd_dir_svc_action = (?msi)Operation:(\s|\r|\n).*(?:Type:)\s+(?<dir_svcs_action>[^(\r|\n)]+)
EVAL-user_obj_email = if(isnull(user_obj_email),if(match(user,"(?=.{1,64}@\S)"),lower(user),if(isnull(User_Principal_Name),NULL,lower(User_Principal_Name))),lower(user_obj_email))
EVAL-user_type = case(match(user,"\$(\,|\@|$)"),"computer",match(user,"SYSTEM|NoGuestsAllowed|ANONYMOUS|NT AUTHORITY|DWM-|LOCAL SERVICE|NETWORK SERVICE"),"system",isnotnull(user),"user",isnotnull(comp_obj_sam),"computer")
EVAL-src_user_type = case(match(src_user,"\$(\,|\@|$)"),"computer",match(src_user,"SYSTEM|NoGuestsAllowed|ANONYMOUS|NT AUTHORITY|DWM-|LOCAL SERVICE|NETWORK SERVICE"),"system",isnotnull(src_user),"user",isnotnull(comp_obj_sam),"computer")
EVAL-group_obj_ldap_v = if(Class=="group",LDAP_Display_Name."|".Value,NULL)
EVAL-user_obj_ldap_v = if(Class=="user",LDAP_Display_Name."|".Value,NULL)
EVAL-gpo_obj_ldap_v = if(Class=="groupPolicyContainer",LDAP_Display_Name."|".Value,NULL)
EVAL-ou_obj_ldap_v = if(Class=="organizationalUnit",LDAP_Display_Name."|".Value,NULL)
EVAL-comp_obj_ldap_v = if(Class=="computer",LDAP_Display_Name."|".Value,NULL)
EVAL-MSADChangedAttributes = if(isnotnull(Old_DN),"Object Moved - ########From DN: ".replace(Old_DN,"\x5C{1}","")."########To DN: ".replace(New_DN,"\x5C{1}",""),MSADChangedAttributes)
EVAL-Old_DN = lower(replace(Old_DN,"\x5C{1}",""))
EVAL-New_DN = lower(replace(New_DN,"\x5C{1}",""))
EVAL-DN = lower(replace(DN,"\x5C{1}",""))
EVAL-group_dn = if(ObjectClass="group",lower(replace(ObjectDN,"\x5C{1}","")),lower(replace(group_dn,"\x5C{1}","")))
EVAL-user_obj_dn = lower(replace(user_obj_dn,"\x5C{1}",""))
EVAL-user_group = lower(replace(user_group,"\x5C{1}",""))
EVAL-Group_Name = lower(replace(Group_Name,"\x5C{1}",""))
EVAL-group_obj_dn = lower(replace(group_obj_dn,"\x5C{1}",""))
EVAL-group_obj_id = lower(replace(group_obj_id,"\x5C{1}",""))
EVAL-group_obj_lkp=if(isnull(user_group),if(isnull(Group_Name),if(isnull(group_obj_dn),if(isnull(group_obj_id),if(isnull(group_dn),NULL,lower(replace(group_dn,"\x5C{1}",""))),lower(replace(group_obj_id,"\x5C{1}",""))),lower(replace(group_obj_dn,"\x5C{1}",""))),lower(replace(Group_Name,"\x5C{1}",""))),lower(replace(user_group,"\x5C{1}","")))
EVAL-comp_obj_dn = lower(replace(comp_obj_dn,"\x5C{1}",""))
EVAL-comp_obj_sam = lower(replace(comp_obj_dn,"\x5C{1}",""))
EVAL-ou_obj_dn = lower(replace(ou_obj_dn,"\x5C{1}",""))
EVAL-cn = if(isnull(cn),name,if(match("\x5C{1}",cn),replace(cn,"\x5C{1}",""),cn))
EVAL-distinguishedName = lower(replace(distinguishedName,"\x5C{1}",""))
EVAL-member_obj_dn = lower(replace(member_obj_dn,"\x5C{1}",""))
EVAL-member_obj_sam = if(isnull(member_obj_sam),if(isnull(member_obj_secid),lower(replace(member_obj_dn,"\x5C{1}","")),lower(member_obj_secid)),lower(replace(member_obj_sam,"\x5C{1}","")))
EVAL-member_obj_cn = lower(replace(member_obj_cn,"\x5C{1}",""))
EVAL-member_obj_id = case(isnull(member_obj_sam) AND isnotnull(member_obj_cn),lower(replace(member_obj_cn,"\x5C{1}","")),match(member_obj_sam,"(?i)^CN\="),lower(replace(member_obj_cn,"\x5C{1}","")),isnotnull(member_obj_sam) AND NOT match(member_obj_sam,"(?i)^CN\="),lower(replace(member_obj_sam,"\x5C{1}","")),isnull(member_obj_sam) AND isnull(member_obj_cn),lower(replace(member_obj_dn,"\x5C{1}","")))
EVAL-member_obj_lkp = if(isnull(member_obj_dn),if(isnull(member_obj_cn),if(isnull(member_obj_id),if(isnull(member_obj_sam),NULL,lower(replace(member_obj_sam,"\x5C{1}",""))),lower(replace(member_obj_id,"\x5C{1}",""))),lower(replace(member_obj_cn,"\x5C{1}",""))),lower(replace(member_obj_dn,"\x5C{1}","")))
EVAL-obj_type = lower(obj_type)
LOOKUP-cs_obj_changes = cs_ad_audit_change_event_codes EventCode AS EventCode obj_type AS obj_type OUTPUTNEW change_action AS change_action change_category AS change_category signature AS change_signature


# WinEventLog System Logs - XML format
[source::XmlWinEventLog:System]
# wineventlog cleared
EXTRACT-logname = </SubjectDomainName><Channel>(?<LogName>[^<]+)</Channel>
EXTRACT-user = <SubjectUserName>(?<user>[^<]+)</SubjectUserName>
EVAL-LogName = if(isnull(LogName), "System", LogName)
EVAL-user = coalesce(User, user, "-")


# WinEventLog System Logs - Plain text format
[source::WinEventLog:System]
# wineventlog cleared
EXTRACT-logname = The\s(?<LogName>.+)\slog\sfile\swas\scleared\. in Message
EVAL-LogName = if(isnull(LogName), "System", LogName)
EVAL-user = coalesce(User, user, "-")



######################
#### Tenable #########
######################
[tenable:sc:assets]
EVAL-tenable_uuid = trim(lower(if(isnull(repository_id), "", repository_id).":".if(isnull(ip), "", ip).":".if(isnull(dnsName), "", dnsName)))
# we are using uniqueness of repository_id, ip, and dnsName to create unique id

[tenable:io:assets]
FIELDALIAS-tenable_uuid = uuid AS tenable_uuid


[tenable:sc:vuln]
EVAL-tenable_uuid = trim(lower(if(isnull(repository_id), "", repository_id).":".if(isnull(ip), "", ip).":".if(isnull(dnsName), "", dnsName)))
EVAL-vul_id = plugin_id
EVAL-vul_name = plugin_name
EVAL-vul_description = description
EVAL-vul_risk_factor = risk_factor
EVAL-vul_synopsis = synopsis
EVAL-vul_version = plugin_version
EVAL-vul_port = port
EVAL-vul_protocol = protocol
EVAL-vul_severity = severity
EVAL-vul_severity_id = severity_id
EVAL-vul_family = plugin_family
EVAL-vul_type = check_type
EVAL-vul_has_patch = if(patchPubDate=-1, "No", "Yes")
EVAL-vul_state = state
EVAL-vul_cpe = mvjoin(cpe, " ,")


[tenable:io:vuln]
FIELDALIAS-tenable_uuid = asset_uuid AS tenable_uuid
EVAL-vul_id = plugin_id
EVAL-vul_name = plugin_name
EVAL-vul_description = description
EVAL-vul_risk_factor = risk_factor
EVAL-vul_synopsis = synopsis
EVAL-vul_version = plugin_version
EVAL-vul_port = port
EVAL-vul_protocol = protocol
EVAL-vul_severity = severity
EVAL-vul_severity_id = severity_id
EVAL-vul_family = plugin_family
EVAL-vul_type = check_type
EVAL-vul_has_patch = 'plugin.has_patch'
EVAL-vul_in_the_news = 'plugin.in_the_news'
EVAL-vul_state = state
EVAL-vul_cpe = mvjoin(cpe, " ,")

